{
  "infirmary":{
    "name": "infirmary",
    "id": "infirmary",
    "north": null,
    "east":"cafeteria",
    "south":"gym",
    "west":null,
    "item":"energy drink,energy drink",
    "description": "The Infirmary is quiet and dimly lit. The walls are painted sterile white and the air is filled with the scent of antiseptic.\n The room is equipped with basic medical equipment, such as a first aid kit, a bed, and a small cabinet for storage.\n Everything is tidy and organized, giving the room a peaceful atmosphere. You feel safe."
    },
  "gym":{
    "name": "gym",
    "id": "gym",
    "north":"infirmary",
    "east":"office",
    "south":null,
    "west":null,
    "item": "running shoes,baseball bat",
    "description": "The Gym is a large, dark and quiet space. The room is filled with athletic equipment such as weights, treadmills, and stationary bikes, all of which are dormant and untouched.\n The high ceilings echoes with the sound of your footsteps. The air is heavy with the smell of rubber and metal,\n mixed with disinfectant. A few dim lights are on, casting long shadows across the room and illuminating the dust floating in the air"
    },
  "cafeteria":{
    "name": "cafeteria",
    "id": "cafeteria",
    "north":null,
    "east":"boy's cabin",
    "south":"office",
    "west":"infirmary",
    "item":"energy drink,batteries",
    "description": "The Cafeteria is a large, empty room with rows of tables and chairs.The walls are painted a pale yellow, and the fluorescent lights overhead cast a sterile glow over the room.\n The air is heavy with smell of cooked food and cleaning agents, a reminder of the meals and activities that took place earlier in the day. "
    },
  "office":{
    "name": "office",
    "id": "office",
    "north":"cafeteria",
    "east":"campfire",
    "south":"school bus",
    "west":"gym",
    "item":"keys,energy drink,energy drink",
    "description": "The Office is small, quiet room filled with the soft glow of computer screens. The walls are lined with shelves and cabinets, and a large desk dominates the center of the room.\n The air is filled with the faint scent of coffee and paper, a reminder of the work that takes place here during the day"
    },
  "school bus":{
    "name": "school bus",
    "id": "schoolBus",
    "north":"office",
    "east":null,
    "south":null,
    "west":null,
    "item":"",
    "description": "The School Bus is a large, quiet vehicle parked in an empty parking lot. The yellow exterior is faded from years of service, and the windows are dark and reflective, hiding the interior from view.\n You enter the school bus. The rows of seats are empty, and the aisle is clear, with a few stray items such as pencils,\n crumpled papers, and empty snack wrappers."
    },
  "campfire":{
    "name": "campfire",
    "id": "campfire",
    "north":"boy's cabin",
    "east":"woods",
    "south":null,
    "west":"office",
    "item":"cloth,energy drink,apple",
    "description": "The Campfire is flickering, orange glow in the darkness. The fire crackles and pops, sending sparks flying into the air and casting dancing shadows on the surrounding trees.\n The air is thick with the scent of smoke and the sound of the fire is the only thing breaking the silence."
    },
  "boy's cabin":{
    "name": "boy's cabin",
    "id": "boysCabin",
    "north":null,
    "east":"girl's cabin",
    "south":"campfire",
    "west":"cafeteria",
    "item":"batteries",
    "description": "The Boy's Cabin is cluttered and dimly lit. The air is heavy with the scent of dirty clothes, sweat, and musty blankets.\n The bunks are a jumbled mess, with clothes and personal items scattered haphazardly about"
    },
  "girl's cabin":{
    "id": "girlsCabin",
    "name": "girl's cabin",
    "north":null,
    "east": null,
    "south":"woods",
    "west":"boy's cabin",
    "item":"cloth",
    "description": "The Girl's Cabin is a peaceful and quiet space. The air is filled with the scent of shampoo, soap, and freshly washed linens.\n The bunks are made neatly, and the bedside tables are adorned with personal items such as books, flashlights, and photos.\n A few small lamps cast a soft glow over the room, creating a warm and cozy atmosphere."
  },
  "woods":{
    "name": "woods",
    "id": "woods",
    "north": null,
    "east":"lake",
    "south":"log cabin",
    "west":"campfire",
    "item":"car battery",
    "description": "The Woods that surround the camp ground are a dark and mysterious place. The trees tower overhead, their branches reaching out like bony fingers against the night sky.\n The ground is littered with leaves, sticks, and fallen branches, creating a crunching sound with each step.\n The air is thick with scent of damp earth, decaying leaves, and the musty odor of the forest."
  },
  "lake":{
    "name": "lake",
    "id": "lake",
    "north":null,
    "east": null,
    "south":null,
    "west":"woods",
    "item":"",
    "description": "The Lake is a dark and eerie body of water surrounded by trees and dense vegetation. The moon and stars cast a ghostly glow on the surface of the water, and the gentle lapping of the waves creates a haunting melody.\n The air is heavy with the scent of damp earth and the musty odor of the lake."
  },
  "log cabin":{
    "name": "log cabin",
    "id": "logCabin",
    "north":"woods",
    "east": null,
    "south":null,
    "west":null,
    "item":"gasoline",
    "description": "The Log Cabin is a dark and foreboding place. The wooden cabin is situated in a clearing surrounded by dense vegetation, and the full moon casts an eerie glow over it.\n The cabin is small and weathered, and the roof is sagging under the weight of years.\n The door creaks on its hinges, and the windows are boarded up, creating a feeling of isolation and abandonment."
  }
}